; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared3 - mode
	spectrograph4 - mode
	image1 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation3 - direction
	Star4 - direction
	Star2 - direction
	Star1 - direction
	GroundStation0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon6)
	(supports instrument1 image2)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument3 infrared3)
	(supports instrument3 image1)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument5 image2)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument7 image1)
	(supports instrument7 spectrograph4)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Star5 spectrograph4)
	(have_image Phenomenon6 infrared3)
	(have_image Planet7 image2)
	(have_image Planet8 image1)
	(have_image Star9 spectrograph4)
))

)

; plan
1. (turn_to satellite2 groundstation0 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation0)
   goals met: 0 of 6
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 6
3. (calibrate satellite2 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 0 of 6
4. (turn_to satellite2 planet7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet7)
   goals met: 0 of 6
5. (take_image satellite2 planet7 instrument3 image2)
   added: (have_image planet7 image2)
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon6 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon6)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation0 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 6
8. (take_image satellite2 phenomenon6 instrument3 infrared3)
   added: (have_image phenomenon6 infrared3)
   goals met: 2 of 6
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
10. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 6
11. (turn_to satellite0 star5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star5)
   goals met: 2 of 6
12. (take_image satellite0 star5 instrument0 spectrograph4)
   added: (have_image star5 spectrograph4)
   goals met: 3 of 6
13. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 3 of 6
14. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 4 of 6
15. (turn_to satellite0 planet8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 6
16. (turn_to satellite2 planet8 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet8)
   goals met: 5 of 6
17. (take_image satellite2 planet8 instrument3 image1)
   added: (have_image planet8 image1)
   goals met: 6 of 6
